Revit 2027 API
ParameterTypeId.DimLeaderType Property
 "Leader Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DimLeaderType { get; }
Public Shared ReadOnly Property DimLeaderType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DimLeaderType {
	ForgeTypeId^ get ();
}
static member DimLeaderType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace